{"article": ["面对这么突如其来的变化，不少SEM竞价从业人员都感到重重危机。KPI完不成，老板要炒鱿鱼？SEM穷途末路，要转型？恐慌、谩骂、抱怨都不能解决问题，行业规则调整是为了更科学合理，SEM人员也应自我调整、积极应对、研究策略，提高专业技能，提升岗位权重，转危为机，然后，拍着胸膛和老板说，我要升职加薪!", "那么，问题来了，新规则下的SEM到底怎么玩，我们才能自信的和老板谈升职加薪？下面根据我10多年互联网推广运营经验、行业分析和未来预判，给所有SEM人员2条思路（操作以百度为例，其它类同）：", "1.1、抓住竞价的核心本质", "2009年开始，百度凤巢系统引入关键词质量度体系，质量度反映搜索网民对搜索到百度推广商家的关键词及其创意的认可程度和需求匹配度，数据反映的重点是该条创意的点击率，质量度分值高低最终影响到关键词的排名展示。从上图的公式可以看出，提高出价直接提升排名，但成本提高意味着ROI降低，而且任性提高出价容易导致关键词恶性竞争，土豪企业可以这么玩。但是作为一名专业的SEM优化师，我们更应该优化质量度和出价的关系，明确企业推广目标，分析宏观数据，寻求ROI平衡点，用老板思维进行SEM。所以，数据挖掘、分析和演绎是SEM急需提升的关键技能，Excel表格应玩得炉火纯青，本质上，SEM是一场数字游戏。", "1.2、丰富创意样式 玩转点击率", "优化文案创意，分析用户需求，创意直达目标用户，从而提高点击率，这个是老生常谈的问题，也是许多企业考核SEM投放和文案人员的KPI。深度研究百度创意样式，竞价后台现有的每个创意结构（创意、附加创意、高级样式）都应该去做测试评估。我个人判断，百度还会推出新的创意样式来提升仅有4个广告位的展示价值，特别是更丰富的图文样式来帮助企业提高点击率，而不是简单的让企业提高点击出价（CPC），毕竟，稳定现在出价，提高点击率才是百度和企业的合（láng）作（bèi）共（wéi）赢（jiān）模式。", "1.3、狠抓有且仅有的4个展示位", "核心词、转化高的词必须拿前四（最好是前三）的位置，修改关键词出价，调整创意，提高关键词质量度，保证其在搜索首页的展现次数。排名靠后的词，可以添加长尾关键词，通过大量长尾词来实现排名展示，泛匹配的词组也需要进行精准修改。活用28原则，把控好整个账户结构。", "1.4、SEO的新机遇", "竞价排名的位置减少，免费排名的位置必然增多。所以，免费SEO优化又可以提上日程。现在SEO更注重用户体验和用户价值（参考我的文章《看看百度又悄悄干了什么？吓死我们SEO宝宝了》），大家把握好SEO策略，本文不展开。", "2.1、竞价背后的商业逻辑", "百度是一家商业性盈利公司，核心目标是赚钱，我们企业也一样。既然目标是赚钱，投放预算就不应该只盯着SEM。一切能出业绩的平台我们都可以挖掘。移动端搜索、DSP定向投放、新社交媒体、SEO等全网投放布局是SEM等广告投放人员急需迅速规划的课题。", "2.2、开放互联思维", "SEM广告投放属于市场营销的范畴，这就需要我们时刻关注各行业资讯，拥有开放的心态，不同寻常的学习、观察、分析、判断和应变能力，洞悉互联网思维，把握人性。", "2.3、解读事物本质", "不管搜索如何变化，但商业的本质不变，术有千万大道至简，SEM技术很重要，但不要只局限于技术，我们应拥有更广阔的眼界看清其本质，以不变应万变。", "陈亮互联网纯手工码字，只为分享互联网和电商推广运营点滴干货，欢迎转载，转载时请注明版权，感谢关注，更多内容会持续发布！"], "title": ["面对3大搜索竞价的调整 SEM这么玩升职加薪分分钟的事！"], "link": "http://www.jianshu.com/p/ee6cbda5abb2", "author": ["chliang2046"]},
{"article": ["近日，苹果继禁了微信等具有打赏功能软件的IAP接口，封杀了打赏功能之后，在2017年的9月中旬放出了再次轻微修改App", "Store审核规则，取消了对第三方应用打赏的抽成规定的消息，新审核规则规定：", "苹果允许了在特定情形下的“货币礼物”(monetary", "gift)不使用苹果应用内购买方式，前提是这个礼物是完全自愿的、100%的金额给到礼物接收者。但是，涉及到数字内容和服务的赏金礼物将被列为应用内消费的范畴，苹果将抽取三成分成，基于数字内容/服务的打赏依然使用IAP的方式。在第三方应用个人对个人的打赏中，苹果将不再抽取30%的收入。", "前几个月闹得沸沸扬扬的抽成问题，终于以苹果“表面服软”的结局收场，但是其背后开发者和管理者立场分歧，却并非表面关于赞赏模式分成这么都摆在明面上。", "我们知道，所谓的“苹果税”是今年4月苹果新推出的规定：APP不得包含指引客户使用非IAP机制进行购买的按钮、外部链接或其他行动号召用语，同时，苹果把iOS版APP的打赏定义为内部购买，每一笔赞赏都必须抽成30%给苹果。正是因为如此，腾讯微信才与苹果展开激烈交锋，强硬拒绝了此项规定，选择关闭iOS版微信的赞赏功能。而苹果此举也彻底激怒了赞赏受益方——内容创作者，加之短期之内，知乎、今日头条、微博问答等也与苹果就打赏问题起了纠纷，一时间苹果被群起而攻之，被挂上了“店大欺客”的名头。", "抛开问题看本质，本质是怎样的呢?那就是苹果公司的管理者和世界各地众多的开发者关于利益方面的重大分歧。苹果公司作为这个IOS封闭圈子的管理者和经营者，各类应用开发者程序员想借用这个平台的“资源+流量+带宽”售卖自产的软件和配套服务挣钱，要给苹果一定比例的分成，这是很合理的规定，这就好比商场内入驻的商家需要给商场抽成或者交租金一样。", "IOS的软件最开始的模式就是一次性购买这个软件的使用权，产生的收益直接打到苹果账户，苹果在每月结算收入70%打给开发者。这个模式最开始出来就收到全世界的开发者的喜爱，因为直接提高了开发者的收入，其他平台抽成会更多。同时，也带给了苹果商店世界第一的位置和百亿美元的分成收入。", "后来，大家软件内的花样就越来越多，直到某天出现了先下载APP试用几分钟，然后再选择是否付费购买全部或者更高级的功能。但是，大多数情况是付费后，收到的是一个激活软件功能的验证码，直接绕过了在苹果商店购买的这一流程，也就绕过了苹果商店的30%抽成，用户付出钱100%落入了开发者的手里，苹果一分也分不到。", "随着这种情况越来越多，大家都变成了免费使用苹果的平台分发软件流量获取收入而不用交租金，苹果商店收入直转而下，情况愈发严重，直到导致了苹果商店IAP新模式的诞生。", "IAP模式规定：如果要付费在APP内解锁特性或功能，那么必须使用苹果平台内的购买接口。如果APP允许用户购买，在APP之外的商品或服务，那么必须使用IAP以外的购买方式来收取相应款项。", "这句话的意思说。APP的附加服务和组件，还是在App", "Store付钱购买，只是换了一个网页UI界面，付款通道还是走的苹果商店，而不是私人通道。而像淘宝购物，外卖等，由于是购买的东西并不是在App内使用的，这些只能使用其他的付款方式如支付宝，微信支付，银行卡等。", "这个条款直接封杀了软件内私人渠道付费的方式，圆满没有漏洞， 定下了条款之后一直相安无事，各行各业遵纪守法。", "平静的水面直到中国互联网市场的飞速发展，各种创新层出不穷，才被一个全新的模式所打破，以微信、知乎、斗鱼，虎牙为代表的内容平台与直播平台的“打赏”机制，让这个规则出现了漏洞，变得摇摇欲坠。", "打赏机制跟IAP模式冲突点在于：一个单独用户付出的钱并不是给开发者的，而是给另外一个单独用户的，而且这里面好像并没有“购买”行为，类似于支付宝转账，不付钱并不影响你看完另一个用户所提供的内容。", "这就让苹果商店的管理者很头痛，APP内购买的内容和组件就应该收租金，但是打赏机制所导致的付费并不是APP开发者所提供的，APP的其他用户也在撰写内容，而这些内容也是这个APP的组成部分。在宏观意义来讲，只要在这些APP写文章的、开直播的都可以算是这个APP的“共同开发者”。这样就很有趣了，既然都算是“开发者”按照IAP规定来讲，那么你从APP上赚到的钱也应该收手续费。", "所以关于打赏应不应该抽成这个问题，无非全部只是在这两点上：", "(1)赞赏算是购买APP付费升级的组件吗?", "(2)用户创作的内容算是App提供的服务吗?", "从更深处的意义来看，并不是只是关于这几个软件的问题，而是苹果商店的基础规定：”IAP规定”的存在的合理与否了。这两条如何界定，显然之前的条款里面是没有很明确的划分的，因此可以存在讨论的空间，争议也就起于此。", "某信的想法随着互联网的唇枪舌炮，在硝烟和战火下一缕缕的低调展开，它的目标自然是想抛开苹果的这一套虽然僵硬但是非常赚钱的生态体系自己建立一个王国。小程序就是这其中的重要工具。深入想一想，如果使用某个小程序需要付费的话，应该走什么渠道呢?", "假如某信内小程序不抽手续费的话，既然某信可以做应用内自带小程序商店，那我大某付宝也可以做，我某德地图同样可以做。技术成熟之后，流畅度可比安装的APP，再用庞大的用户量把你苹果商店核心竞争力抢走，把苹果直接变成一个鸡肋，一两年不打开你一次，成了压箱底的软件了。我想，这才是苹果商店不留情面直接封杀的核心原因。", "不过，仅仅几个月时间，苹果就放宽了该项规定，苹果这一条新规中，取消抽取 30%", "的分成，但是打赏通道依旧要在IAP框架内，全程在苹果商店的监视下进行。最后还有一条，第三方应用开发商也不得从个人对个人的打赏中抽成。", "这两个规定这是什么意思呢?直白点就是我赚不到的钱，你们也别想赚，你们抽成我也跟着抽成。这也就是对于某鱼、某牙等直播平台依旧抽取分成的原因。"], "title": ["苹果赞赏抽成的伊始，是疯狂逃税的众多IOS软件"], "link": "http://www.jianshu.com/p/3a04f59164f7", "author": ["拓天姬"]},
{"article": ["苹果在北京时间9月20日凌晨将正式版iOS11推送出来，早上起来也是第一时间将手机（iPhone 6s）和iPad Air（2014年）升级到最新版本。", "整个过程也就10多分钟，写一篇文章的时间。由于iPad是3年前的pad了，升级时间比iPhone长了7-8分钟。弄完就去上班Working了，手机也按照办公场景正常使用了一天。先说结论，", "iOS新系统的亮点和细节还是较多的，各大媒体应该在为正式推送前就扒皮式的将其新特性一股脑的放出来了。比如可定制增强的控制中心、个性化存储建议、自动删除长期未使用过应用（Offload）、屏幕录像、单手键盘、原生二维码、分屏多任务（ipad）、信号条、AppStore等等。", "我根据一天使用情况，介绍下比较实用的几点。", "可将各种常用的控制功能放到控制中心，这样将移动网络开关、省电模式开关等常用就能第一时间呼出控制中心进行设置。避免之前打开系统设置找到相应项目进行控制了。", "强烈推荐，可直接在手机录屏，将视频保存到photo里。以前需要连上Mac电脑，QuickTime录制手机的操作视频或者Demo。这应该是大大的方便了我经常录制产品演示Demo的工作。", "Home + 关机键进行屏幕截图，新的版本里屏幕截完图会在左下角将截图图片停留几秒，点击该图片，可直接进入到图片标注模式，高效方便。这个标注模式主要是在图片上划线涂抹，跟相册里的照片编辑（裁剪、旋转、滤镜等）不一样。", "系统设置里的", ",可以更好的优化手机的存储空间利用率了。系统会给我一些优化建议，可以选择", "，当存储空间不足时，自动卸载未使用（或者长期不用）的应用，但是会保留数据。当然你也可以查看各个APP的使用情况，进行空间优化。", "无论是iPhone 6S还是iPad Air，都没有卡顿的现象。整个使用起来感觉速度快了。不知道是真快了，还是用户体验感受快了。", "iPad好久没更新系统了，这次比较意外的是真的没有卡顿。dock栏用切换应用很快，可以多屏操作了，不过我这pad硬件太低，1G RAM不支持左右分屏操作，生产力不能进一步解放啦😝。但是可以浮动方式将应用浮动在另一个应用的左边或者右边。", "以上就是一天的感受，推荐更新iOS 11。", "趁着年轻，赶紧折腾！"], "title": ["使用了一天，iOS 11值得更新"], "link": "http://www.jianshu.com/p/f37fe4948092", "author": ["GISCAFF"]},
{"article": ["科技云报道原创。", "2017年，无论是AI、VR/AR还是IOT(物联网)对计算能力和存储能力的需求都会远超以往，这一切都对IT基础架构提出了巨大的挑战。而超融合凭借部署灵活、强扩展性、资源管理高效集成、低成本运行等优势，为变革传统IT模式提供了更多可能。", "继去年中国迎来超融合元年之后，今年联想给国内超融合市场再度投掷下一枚重磅炸弹。9月20日，联想超融合在深圳举办新品发布会，正式推出以应用感知为核心的三款超融合新品：以KVM为核心的H1000高级版、以商用虚拟化平台为核心的H3000企业版和H3000标准版。", "三款产品进一步以应用为核心，充分支持商业应用。同时强化网络虚拟化能力，实现NFV的全面支持和集成SDN的良好能力。此外，新品支持混合应用负载和全闪存，将IT性能推升至全新高度。", "联想超融合副总裁高志国在“超融合2.0——应用感知新时代”主旨演讲中表示：“未来的超融合将由物理层面向以用户和应用为主导的感知层面推进，通过不断拓展应用场景，满足用户对存储、计算等多方位的体验和需求。”由此，联想正式拉开以应用感知为核心的超融合2.0时代序幕。", "超融合2.0时代：从技术架构到应用感知的全面进化", "从技术成熟度曲线来看，HCIS（超融合系统）始终处于最“热”的顶点位置。过去一年多，国内超融合市场始终保持“加速冲刺”的状态，2017年Q1，全球超融合市场销售额同比增长64.7%，达到6.561亿美元。", "根据Gartner预计，2016-2021年全球超融合市场的年复合增长率为48%，而中国则有可能超越这个步伐。按照这一发展趋势，未来3-5年超融合将真正成为市场主流。而以应用为核心、企业级的定制化超融合将是未来超融合的重要发展方向。", "今年，国内以联想为代表的中国IT厂商在超融合领域不断发力，进一步激发了该细分市场的活力与潜能。回顾2016年，由联想集团牵头，与中国电子学会、Nutanix、华三、深信服等在内的国内知名超融合厂商和机构，率先发起成立国内首个超融合产业联盟，宣告“中国超融合元年”的到来。", "之后，联想又于去年5月发布“寻找超融合最美合伙人”计划，并推出AIO-H1000和AIO-H3000两款超融合全新解决方案，启动全国范围内的超融合试用活动。", "作为超融合产业的积极实践者，联想迄今为止已向数百家来自教育、医疗、制造等行业的客户提供超融合解决方案，成功实现企业IT转型。目前，已有超过30%的企业开始基于联想超融合方案承载核心应用和关键业务。", "在现有超融合技术优势基础上，联想超融合解决方案以自主可控、具备弹性、可定制化的应用感知模式替代传统僵化的技术架构模式，逐步向核心应用层面切入。", "在功能上，AIO全面支持SAP、OracleRAC、桌面云、微软Exchange以及更多的商用套件，企业可以通过超融合实现基础设施平台的统一管理，并基于自身实际需求构建企业云，全面扩展了超融合的应用场景。", "同时，联想AIO实现NFV的全面支持和集成SDN的能力，在现有的超融合平台上，联想AIO进一步增强网络虚拟化能力，例如虚拟化的防火墙、负载均衡等网络设备，满足网络、存储、计算统一管理的同时实现。此外，AIO还能支持混合工作负载以及全闪存，并可在同一个超融合平台上提供可预测的性能指标，如I/O性能达37万、时延低于2毫秒，满足用户对于应用的多样性需求。", "联想AIO的Cloud-Ready将充分支持企业搭建混合云平台的需求，对于那些部分业务运行在公有云上的企业来说，可以帮助其打通超融合与公有云，通过公有云提供资源弹性扩展和容灾备份的能力。", "三款新品齐聚亮相 超融合市场再迎重磅产品", "20年前，盛行的物理架构被虚拟化技术颠覆，未来10年，我们同样有可能见证超融合取代“传统”虚拟架构。在这样的浪潮下，联想开发出丰富和成熟的超融合产品线。其中ThinkCloudAIO，就是联想超融合的重要产品。目前有两条产品线，基于商用虚拟化平台的H3000系列和基于开源平台的H1000系列，满足不同用户群体对超融合的需求。", "联想在超融合产品设计上，充分发挥超融合平台高性能特性，拥有更高的IO性能，实现快速横向拓展。结合专利的秒级克隆技术，帮助用户加快业务上线，提高生产效率。通过分布式架构，联想超融合让用户在运维管理上更加统一，用户可以用一个界面管理所有存储和网络对象，能够帮助用户大大节省综合成本，获得更高的经济性。", "此次联想超融合在已有的H1000、H3000系列基础上，正式推出三个新版本，分别是以KVM为核心的H1000高级版、以商用虚拟化平台为核心的H3000企业版和H3000标准版，也是应用感知融入超融合解决方案的一次里程碑式实践。", "H1000高级版以计算存储为基座，高级版优化集成了分布式交换机、虚拟防火墙、虚拟路由器，实现一键式拖拽的网络架构设置，为客户提供一站式计算存储网络安全的超融合解决方案。基于开源KVM，H1000高级版深度集成定制，丰富的周边国产化应用方案，满足政府、军工等特殊领域的国产化需求。另外，秒级快照克隆技术，也会大大提升用户体验。", "H3000企业版则在存储、切换应用无感知、本地化等多方面实现更大提升。针对应用，H3000企业版可以对存储的多个参数进行调配，如存储块大小、读缓存、压缩块，通过存储块配置，支持Exchange性能提升20%。", "在效率方面，该版本对应用数据采用不同数据压缩算法提升效率：数据库数据采用LZ4压缩算法，提供高速压缩；视频数据无需采用压缩；采用Gzip压缩算法可以减少对内存资源的开销。", "在性能和可靠性方面，H3000企业版使文件级IO的本地化操作更为便捷，每个虚拟机文件都会向IO提供服务和本地化操作，虚拟机漂移后，IO服务会跟随虚拟机迁移，极大地降低了企业用户在搭建和应用超融合的门槛。", "作为新一代数据中心基础架构的选择，超融合无论在技术驱动、用户需求、政策环境等方面都站在了一个历史性机遇的窗口。我们很高兴看到，国内以联想为代表的企业快速反应和布局，通过更多元、更贴近用户应用场景的超融合解决方案，不断给国内的企业提供强有力的技术支撑，并推动中国云计算市场强势跻身全球第一梯队。这么看来，中国云计算的未来将不可估量。", "【科技云报道原创】"], "title": ["科技云报道：从技术架构到应用感知 联想超融合进入2.0时代"], "link": "http://www.jianshu.com/p/9dc1f1502259", "author": ["科技云报道"]},
{"article": ["厚积而薄发，这点我们在投资B2B的项目时都深有体会。", "B2B的发展确实相对很多to C的项目是慢的，当行业风口四起的时候，能沉下心，是蛮难的。其实很多一直在看B2B的机构，包括我们，在这两年间或多或少都犹豫过，我和很多别的基金看B2B的朋友交流的时候，大家都是互诉苦水，B2B领域投资门槛高，需要投入更多精力。各个传统行业像钢铁、石油、面料、塑料、工业品、快消品，任何一个行业存在了这么多年的经销体系虽然低效，都是有它存在的逻辑与价值，要去重塑它是不容易的，每个行业都需要深入挖掘。所以我从内心，是非常非常钦佩敢于在B2B领域创业并且坚持的团队，那是需要眼光、勇气与毅力的。", "而这两年一些B2B公司调整转型后，当真正抓住了恰当的切入点，公司就像是一下突破一个临界点，无论是从客户反馈还是最直观的数据，你都能感受到公司步入了快速增长的轨道。并且这时的这种“快”，不同于烧钱换GMV，而是健康的，有利润的。", "所以我们希望看到公司调整后的“快”，数据则是最直观的体现。这里我想和大家分享一些云启看B2B领域所关心的核心数据点和背后的逻辑。我们希望看到“快”，一定是要有质量的、有毛利的，同时可持续的。", "1. 有质量的，是要看到GMV增长，更要看到增长的动力来自哪，以及天花板在哪里。", "最主要关注的三个指标：下单留存率、客户渗透率、用户集中度。", "1）  增长不能仅仅依靠拉新，还要看老客户的存续。传统行业生意关系更看重信任，所以平台早期获客难度高于To C领域，但是长期留存率远远高于后者，我们看到不错的平台不仅6个月留存，甚至12个月，24个月的留存，都是稳定在30-40%以上。", "2）  老客户更好的下单行为不仅能带动GMV增长，更验证了平台的价值。所谓渗透率，则是能不能让客户每个月更多的采购额在平台上发生，平台对于客户来说是不是逐渐变成一个重要的采购渠道。像百布，很多客户从开始一点点的采购量逐渐增加到每个月50%甚至更多的采购在平台完成。", "3）  用户集中度，这里包括新客和老客户的比例，大客和尾部客户的比例，各区域、各细分类型的客户。客户结构分拆帮助我们判断客户群体天花板，哪些细分客户群体是平台主要的客户群体。同时不同类型的客户群体也会对应公司不同的发展策略和服务方式。", "2. 有毛利的，是现在B2B公司必须追求的。", "传统产业不同于To C领域用补贴获取客户的逻辑，做生意就是当你提供了足够的价值就能有钱赚，当你的议价能力不断提升就能有更多钱赚。我们关注平台在产业链的位置和未来的延伸空间。此类垂直型网站众多，例如：中国黄页（", "）、全天候贸易网（", "）、金安发（", "）、列表网行业市场（", "）。这些站点提供了发布产品和服务的信息平台，使商家能够通过平台获得所需要的信息，进而促成交易。", "1）  首先我们关心客户的需求在哪里，平台提供了什么核心的价值，有价值产生才能有钱收；其次平台比传统商家优在哪里，效率提升在哪里，我们需要利用互联网手段和技术方式提高公司运作效率。另外平台能有多大的集单效应，从而产生规模效应，未来能够对上下游有足够的议价能力，类似百布和找油，都是汇集了下游足够多长尾的订单，规模化向上游采购拿到更优的价格，能比客户以前拿到的价格至少便宜10-15%。最后产业本来的毛利情况，传统商家的经营情况，这里面能看到平台切进去后的基础利润空间。", "公司的毛利简单来说就是：能替代的传统商家的毛利+效率提升的增量+规模效应的增量-给上下游的让利。", "2）  公司能延伸切入的环节空间。能不能向更上游延伸到生产环节，或者向下游扩展至最终端的客户。能切入越多的链条，意味着有机会吃下更多的毛利。比如是否能向上游生产环节延伸，一是看品类的品牌化程度，品牌化程度高则不利于平台扩展自己的产品品牌；二是看生产资源的稀缺度和垄断度。找油网这个油品领域向上游扩展是困难的，但百布是容易的，因为面料没有品牌，上游厂家分散且没有议价力，而我们投资的另外一家家纺B2B公司千家万纺，则属于面料的下游，其向上延伸的空间可以更大。", "3. 可持续的，则是要关注平台的履约成本和内部人效，单订单是否能盈利。", "除了毛利率本身，这里面最关键的因素反而是两个很简单的指标：客单价和SKU数量。客单价越低，往往分摊在一单的履约成本比例就会高，SKU越多，业务流程和操作会越复杂则相应的成本会上升。所以就像找油，数万的客单价，简单的SKU，履约效率会很高，单订单更容易盈利，更简单的流程也会使平台跑的速度更快。", "这里需要做一个看似简单但其实很细节的拆分，即需要分析业务的单位模型。B2B本质是个更高效更综合的服务商，效率即体现在用了技术手段、内部优化管理、集中化之后人效更高。我们通过过往历史数据，以及现场考察每一个业务环节一线业务人员的操作效率，把一个订单对应的所有履约成本拆解，分析现阶段以及未来可能的人效优化空间，这些履约环节包括比如销售、采购、订单处理、仓储、分拣、物流等。例如在销售环节，单销售服务的客户人数，拓新人数目前是怎么样的，目前的销售转化率与区域覆盖率有多少的上升空间，平均服务时长、拜访次数和客户地理距离这些因素未来优化的空间，都是判断人效的基本指标。"], "title": ["产业互联网的“慢”与“快”，数据与数据的背后"], "link": "http://www.jianshu.com/p/ee19740e5e94", "author": ["吴雨桐儿"]},
{"article": ["在上两篇文章中我介绍了如何直接将Geotiff（一个或者多个）发布为TMS服务。这中间其实我遇到了一个问题，并且这个问题伴随Geotrellis的几乎所有使用案例，下面我详细讲述。", "无论在将Tiff文件使用Geotrellis导入Accumulo中还是直接将其发布为TMS服务，其实这中间都存在一个问题：当多个Tiff文件存在重叠部分的时候如何接边、去重叠以及在边界处的瓦片如何取出各Tiff文件中涉及到的数据，即保持瓦片显示效果的完整性。", "这个问题可以说是一个问题也可以说是两个问题。当我们采用事先导入Accumulo中的方案的时候，这个问题不存在（下面会介绍不存在的原因），这也是我一直没有理会此问题的原因，而当我们直接加载Tiff文件为TMS服务的时候这个问题便出现了，当某一个瓦片对应的是两个或者多个Tiff文件的时候，无论选用哪一个文件都会导致最终的瓦片数据不全。接下来我们就来解决这个问题。", "要解决这个问题，首先要搞明白Geotrellis是如何读取Tiff文件的。", "Geotrellis使用HadoopGeoTiffRDD类将Tiff文件直接读取为RDD，主要方法如下：", "其中path为传入的路径，所以configuration方法是关键，其定义如下：", "withInputDirectory方法定义如下：", "看完这两个方法我们是不是就豁然开朗了。extensions是一个Tiff文件扩展名的集合。当此文件是tiff文件的时候就直接读取他，如果不是的时候就以他为文件夹读取他下面的所有可能tiff文件，所以我上面说事先导入Accumulo时该问题不存在，因为那时我传入的正是文件夹，系统直接帮我达到了想要的结果。", "所以我们就可以明白，如果你想让Geotrellis处理接边、重叠等问题可以直接传入包含所有要处理的Tiff数据的文件夹，这样系统就会自动处理（具体的接边、去重叠操作在rdd的union方法中，由UnionRDD类具体完成）。", "所以我们的Tiff文件直接发布为TMS也可以才用同样的处理方式，只需要将文件夹传入即可，这样在涉及到重叠、接边区域的瓦片还能保证数据的完整性。但是这样又出现了另一个问题，如果一次读入所有文件势必会造成处理速度很慢，那么我们为什么不能只取出当前瓦片涉及到的文件呢，如果只涉及一个Tiff就取一个，如果涉及到多个Tiff就取多个。这样既不会造成数据缺失也不会造成读取缓慢。先来看一下最终效果。", "我下载了14幅连续的srtm数据，采用上述方式发布的TMS最终结果如下图：", "从中可以看出拼接的效果非常好，如果是只读取单幅Tiff的情况必然两幅之间会存在空白，采用这种逐一读取的方式，不仅结果完美，效率也较高。下面来介绍实现方案。", "整体实现方案如下：", "上一篇文章中已经大致介绍了此块内容，在这里再简要介绍一下更新后的版本，代码如下：", "其中sc为SparkContext对象，hdfsPath为HDFS中Tiff文件夹路径，files即为此文件下面所有文件，getExtent函数获取传入Tiff文件的空间范围。filter操作过滤掉非Tiff文件以及与extent（瓦片的空间范围）不相交的Tiff文件。这样就可以得到所有与此瓦片有关的Tiff文件。", "此步又有两种思路（原谅我最近中国哲学简史看多了，总想往高大上的哲学上套一套）：", "两种方案各有利弊，第一种需要自己写读取多个Tiff文件的方案，第二种需要我们手动union，在这里我都介绍一下。", "解决思路就是将多个Tiff文件提交到上述的conf中，这样系统就会自动帮我们读取。简单的说就是改写上述configuration函数。代码如下：", "其中paths为上一步获取到的与瓦片有关的Tiff文件集合。只需要重写上面的读取Tiff的apply方法，将其中的configuration换成此函数即可。", "思路清晰明了，代码如下：", "很简单的代码，先对Tiff文件集合进行map操作读取所有rdd，然后执行reduce操作，reduce执行的函数为union，即将两个rdd联合，意味着拼接和去重叠。这样也可解决问题。", "本文简单讲述了使用Geotrellis处理Tiff文件时的两个细节，通过这两个细节能够让我们对Geotreliis的核心更加了解，也能够使我们更加便捷和灵活的处理实际中碰到的关于数据方面的问题。", "Geotrellis系列文章链接地址"], "title": ["geotrellis使用（三十三）关于Geotrellis读取Geotiff的两个细节"], "link": "http://www.jianshu.com/p/d1cf3400f8e8", "author": ["魏守峰"]},
{"article": ["当一个Web系统从日访问量10万逐步增长到1000万，甚至超过1亿的过程中，Web系统承受的压力会越来越大，在这个过程中，我们会遇到很多的问题。为了解决这些性能压力带来问题，我们需要在Web系统架构层面搭建多个层次的缓存机制。在不同的压力阶段，我们会遇到不同的问题，通过搭建不同的服务和架构来解决。", "\n　　", "\n　　Web负载均衡（Load Balancing），简单地说就是给我们的服务器集群分配“工作任务”，而采用恰当的分配方式，对于保护处于后端的Web服务器来说，非常重要。", "作者：蹦蹦跳跳", "\n文章出处：5CEO.CN-技术之家"], "title": ["微服务和集群搭建"], "link": "http://www.jianshu.com/p/decbba1f5944", "author": ["Jokey2017"]},
{"article": ["告别汽车之家，李想再创业。十几年来，他一直忙不停歇。也许是时间的锻造让他在创业领域驾轻就熟。但就是这么一个人也并不是没有弱点，这一期李想反思自己的创业投资历程。", "之前做了几年的天使投资人，回头看一下，投资成绩可以用极差来形容。", "我自认为是一个还不错的创业者。从结果上来看，一方面在自己的市场领域获得了绝对的领先优势，另一方面也让投资者、团队有了非常可观的经济回报。", "再看看自己的天使投资，为数不多的两三个成功案例，说白了都是走了狗屎运，和自己的判断以及对团队的帮助没有任何关系。成功的案例普遍也不需要我操心和帮忙。", "为什么一个还算有成功经验的创业者，投资却很糟糕？在我彻底停掉所有的投资以后，我反复思考这个问题，终于找到了答案。", "90以上分的优秀人才可遇不可求，遇到了进入我们团队，他们都可以100%的发挥自己的最大价值，源于我真的信任和放权。60-80分的普通人才，我也很擅长把他们培养成90分以上的优秀人才，从而发挥巨大的价值。因为他们每天都在我身边，我不怕他们犯错，信任和重用，帮助他们成长。", "到了投资就不一样了，我不是专业的投资人，所以没有时间去挑选那些最优秀的创业者。我还是以创业的心态来做投资，觉得60-80分的人也就够用了，可以把他们变成90分以上的优秀创业者。可结果往往非常糟糕，和创业不同，这些能力一般的创业者并不天天在我身边，我对他们产生的帮助和影响力非常有限，甚至很多在自己团队里一两句就说明白的事情，他们一两年都搞不明白，或者搞明白了也晚了。", "所以投资创业的人才没得培养，只有选择，是那块料就是那块料。我也总算明白了身边几个搞天使投资成功率高的职业投资人，比如黄明明，他每天最核心的事情就是百里挑一的找到90分以上优秀的创业者，最后成功的概率肯定高一个量级。他追着投资我所付出的时间和精力，远远超过了我当年追女朋友的付出。", "我作为一个创业者搞天使投资，除了钱有不少的损失，其实幸福感也全无。看着一帮能力平平的创业者连最基本的重点都找不到的瞎折腾，和他们讲也没什么用，有劲也用不上，真的是很痛苦。相反，我把一些创业失败的平庸创业者拉进我的企业，变成我的下属，他们的能力反而就和打开任督二脉一样，疯狂和高效的吓死人。", "至此，我也就不用纠结了。", "ALL IN，每天累得要死，快乐的一塌糊涂。也停掉了所有的投资，转投自己，也算是扬长避短。很多人来看我们组建了几个月的团队和整体工作进度，都认为我们已经开展了一两年了。", "找到适合自己的事情，比什么都重要。", "创业是我擅长，有一些经验可以分享给各位。", "首先要遵循一些大原则。", "互联网创业到底什么最重要？无非两个选择，一个是用户，一个是客户。腾讯的IM使用者是用户，增值服务的消费者是客户，广告商们是客户；百度的访问者都是用户，而投放竞价排名的各种各样的企业和公司是客户；淘宝的消费者是用户，所有的卖家都是客户，虽然有的卖家不付费，但也是客户。", "传统的草根创业者，大多是用户第一的选择，中国按照市值计算，最大的互联网公司前三名也都是用户第一（假如你认为阿里巴巴集团里面淘宝和支付宝的价值大于阿里巴巴B2B）。用户第一的原则需要至少2-3年的磨练，才会看到大规模盈利的曙光，所以这类公司基本上前两年都是赔钱的，赔个四五年也完全可能，但是一旦形成规模，就会很大。", "如果是客户第一的原则，初期的发展速度比较快，很容易在一两年就达到千万上亿的收入规模，但是瓶颈也会来得更快，因为变现能力远远超越了创造价值的能力。", "还有很多人连哪个更重要都很不清，这样的干脆就先别创业了，想明白了再创业。", "当然，这个世界上还有一类创业者，这类创业者认为想到了是最重要的，认为想到了等于做到了，而且还会以为这个世界上就自己想到了（其实别人早就想到了，并早就开始行动了），在互联网创业领域这样的人还真不少，这类创业者损害了投资方和员工们的利益（这类创业者的恶性结果最经常见的就是解散公司或者拖欠员工工资，让投资人的钱打水漂），最重要的还是害了自己。", "其次信念和心态也尤为重要。", "自信和信心两个词翻来覆去，不管怎么说，我都认为是一码事，是关于信念的。", "一个人的自信和信心我认为有三个级别：", "比如你对苹果公司的发展有信心，你对中国足球队世界杯夺冠有信心，你对你哥们能成为HP的新CEO这件事有信心，对事的信心与行动无关，与自己也无关，属于脑子里面打飞机的信心，不存在驱动力，也是所有人都会有的信心，这个层面的信心其实毫无意义，所有人都可以有，没有难度，没有挑战，很多人认为这个层面的信心只有他自己独有，就停在这里了，然后什么都没付出，什么实际结果也没发生。", "或者换种说法，这种信心是一种假的自信和信心，最害人了。", "比如，我要从一个新人三年内做成一个主管，我要五年时间做一个中国最好的汽车网站，我要30岁之前开上宝马车等等。一个认为自己可以做到的目标，配合可以到达目标的动力，再有一个脚踏实际的过程，这就是第二级的自信和信心，这类人普遍学习能力强，意志坚强，自我要求高。每一个组织和团队都需要有这样的人，企业才能更好的发展，家庭才能够幸福。", "这是一个合格的自信，但仍不足以领导团队，达到这个级别，能够做好自己、管理好小团队，还不足以领导和管理更大的团队。", "能够相信事情谁都会，能够相信自己有一定难度，而最难的是能够相信别人，从而让别人变得越来越自信、越来越好。", "我还是用金子的说法来描述第三级自信，任何人在完成中国最基本的九年义务教育后其实都是一块金子，可能因为种种原因，这块金子有点生锈，看起来像一块生了锈的铁。于是就会出现这样一个状况，我认为他是一块铁，所以我对他的要求也只是做铁的事情，他也认为自己是块铁，所以他一辈子就是块铁，顶多是块好铁和烂铁的差别。", "而第三级自信的人会坚信，你其实就是一块金子，所以虽然你现在表面的样子是铁，但是他会以金子的要求来要求你和帮助你，这个短暂的过程会很痛苦，但是结果很不同，虽然你的结果可能还不会马上成为金子，而是铜或者银子，你却已经搞明白了，原来我不是铁，我的真身其实是金子，从此你的自信和自我的要求会截然不同，你会用一切努力使自己成为金子，并以金子的标准做事，并享受着金子的成就和价值。", "其实我们大多数人都是金子，少数人是钻石（天才），但是我们可能以破铜烂铁的方式创造着价值、要求着自己并活着，这个世界也并不缺少金子，真正缺少的是拥有第三级自信的人，把金子还原成本来的面貌。而一个真正的领导应该干什么呢？让铁变成金子，有金子的信心、提出金子的要求、创造金子的价值。", "第三级自信是一个态度和信念，不是一件事，所以不需要漫长的过程。把铁变成金子也是一样的，10天和10年其实没区别。", "「好心（初衷）办坏事（结果），好心（初衷）没好报（结果）」，这是身边很多人遇到的问题。关于这个问题我也思考过很多年，目前而言，我的看法很简单：「好心多数会办成坏事，好心多数会没有好报，只有平常心才能真正办好事」。", "为什么好心办坏事？好心没好报？为什么很多善良的夫妻却走不在一起？为什么很多好心的人处处受排挤？", "我估计这个问题很多人到死都想不明白。", "我信奉人本善，但是绝不认为人是没有私心的，是个正常的人就会有私心。", "「好心」也是「私心」，一个人把自己假设（说难听点是意淫）的「好」放在自己心里去对待别人（而不管别人到底是否需要），在心中为自己放了一个「贷」给对方，对方莫名其妙的背了一个「债」（仅虚拟的存在于「好心人」的内心）。", "但问题来了，除了「好心人」，没人能准确的猜到「好心」到底好在哪里，所需要的回报是什么，所以当回报和「好心人」的期望值不相符的时候，「好心人」可就不再是「好心人」了，而是「伤心人」，「好心人」自己内心意淫出来的「一切」全都会变成负面的行为和自私，从而变成负面的结果，同时还觉得所有人对不起自己。", "「好心」的「心」是让人猜不透的，是超级自私的，并造成了这个世界上大多数的恶果；「坏心」的「心」也是让人猜不透的，是超级狠毒的，但是造成的恶果其实远远少于「好心」造成的。", "由于「好心」不需要利益的回报，所以「好心」的回报需求更千变万化难以满足，是一种极度自我、极度自私的寻求内心自我满足的表现，从结果上看是人性中最可怕的一种表现，是多数恶果的「因」，只不过伪装成了「善」而已，是真正的伪善。", "只有一个「平常心」才是不需要别人去猜测的，自己心里没有「贷」，别人身上也没有无形的「债」，能够以一颗「平常心」去做事，才会有好的结果。", "只有「平常心」才是真善，既不左，也不右。", "以一颗平常心去做事，通常都会有好的结果和好报。", "先反过来讲，这世上真的没有真的不求回报的人，我们常说的不求回报，只不过是不求利益上的回报而已。", "不要利益上的回报，那就肯定需要别的回报，不如内心的满足等等。", "不要利益回报的人，其实是最难满足的人，从结果上来看是最自私的人。", "到底什么是平常心？", "合理的去追求利益，这是一个正常人应该有的常态，只不过我们的社会把这再正常不过的心态演绎成了功利和负面的，把那些真正自私的难以满足的回报描述成了伟大和英雄。", "黑的描成了白的，白的说成了黑的，谁让咱们是少数服从多数（而不是公平为先），哪怕多数都是白痴。", "平常心等于：", "1、首先要对先自己负责，再对别人负责；（一个对自己都不负责任的人，如何对别人负责？一个对自己都不负责的人，知道什么是责任才见鬼呢！）", "2、在不伤害别人的前提下，必须先对自己好；（没吃过糖的人怎么可能给别人甜头？别总觉得别人欠你的，总觉得别人欠自己的人都是SB，只有你的白痴智商才造就了别人欠你的幻觉，从你生下来到死，没人欠你的！）", "3、合理的追求利益是再正常不过的；（因为结果和价值的回报就是利益和价值成就感。不求利益的人其实是伪善的，是最自私的，是最容易形成自我幻觉，感觉别人亏欠自己的。）", "4、在对自己好，对自己的负责的前提下，去对别人好。（在你觉得没人亏欠你的前提下，从结果上你必然你会发现，所有人都好了，相信我的这句话。）", "方向是创业和发展的第一个重要指标，方向不是目标，目标有终点，而方向永远没有终点。", "什么是方向？方向就是你要为什么而奋斗，我们的方向就是IT和互联网，GOOGLE的方向就是信息搜索。", "不过别钻牛角尖，方向其实是清晰而模糊的，方向是具有辐射性的，不是说我们做IT和互联网，别的就一律不做，只要和这个方向相符、相关联的，而且有利可图，都可以去做，就和GOOGLE也做纸媒体广告，微软也出游戏机一样，只不过，主线一定是你的方向。不过，如果你做互联网的，还要去做钢材，那就出问题了，除非你是多元化的集团。", "一个人的方向是可以改变的，不过改变的代价也是很大的，改变方向以后等于又在新的方向上回到了起点，所以，对于年轻人和创业者而言，方向是非常重要的。", "说的再难听一点，即使我们自己很笨，只要坚持一个正确的方向，一直坚持，也会取得不错的成果的。", "有了方向，目标就会更加清晰，也可以更加有效的去管理目标，当一个目标达到后，去挑战更高的目标。", "铁哥们、兄弟姐妹、老爹老妈、老婆等沾亲带故的，一律不要出现在你的股权架构中，在中国，太多的企业家因为沾亲带故把企业搞死，或者企业活了，亲人都没的做了。", "方向是模糊的，目标是清晰的，很多人说生活和人生感到迷茫，其实最重要的就是，他失去了目标。", "汽车之家的时候，我们团队比较喜欢大学毕业生，他们身上的「臭毛病」比较少。我发现大学毕业生可以分成两类：一种是上学就有明确目标的，这些人在上学的四年中，除了正常的学习，还会围绕自己的目标去学习和提升，所以，这类大学生特别好用，只要工作的意愿够高，可以快速成为一流的员工；还有一种类型的是大学上完了还没有目标的，为了上学而上学，他们来面试的时候也不知道自己要做什么，只是有什么工作就干什么工作，或者干脆一坐，问HR你能给我安排什么工作？", "我们100％不会用第二类的大学生的，因为培养的成本太高了。", "所以，我建议大学生们，早一点给自己找到一个目标，在进入社会后，你可以比别人至少早两年进入正轨。", "我们发现了目标的重要性，不过目标的制定也不是那么简单的。", "目标，一定要现实又具备挑战性。当我们完成一个目标以后，再去挑战更高的目标。", "目标又分为眼前的目标、阶段性的目标和战略目标。我讲一下我自己的目标有过那些改变。", "我上高三的时候，我的目标是大学毕业以后，去一个好的杂志当编辑，可以拿2000-3000元的收入，不过这个目标当年就完成了，我做了自己的网站（相当于拥有了自己的杂志），每个月有6000-7000元的收入，那时候我还在上学。", "当这个目标完成以后，我又有了新的目标，我要把网站商业化运作，2000年我的网站就开始商业化运作，虽然那种商业运作幼稚的可笑，但是也算迈了这步。", "接下来的目标是赚钱，为了实现赚钱的目标（眼前目标），我还从石家庄到了北京，2003年我想要赚的钱赚到了，车和房子都有了。", "新的目标（阶段性目标）是把网站做的更好，1000万美金卖掉（竞争对手的网站已经以这个价位卖掉了），所以我们就努力做，每年的收入都翻倍，2004年底，网站确实可以卖掉了，但是我不想卖了，因为这么多年来，我最大的收获是有了一个这么好的团队，要对这个团队负责，所以目标（战略目标）又提高了，我们要去上市，2009做到上市。上市不是空话，要针对上市进行针对性的目标管理，把5年时间要做的事情细分到每年、每季度、每月、每周甚至每天……", "这是我个人和团队的目标的发展历程，你会发现，我起初目标其实是非常朴实的，简单的，甚至自私的，但是这些目标就是不断实现更大目标，成就更大的事业的必经之路。", "而企业管理中则会运用到目标管理，这个从目标的制定、目标的实施、目标的监督考核、目标的总结、目标的修正，看起来是很复杂的，但是作为管理工具是相当有效的，企业发展到一定程度，一定会应用到目标管理的，对这方面有需要的朋友我建议大家多买几本书看看。", "目标是导航标志，阶段性的成果分析工具，目标就是我们人生和企业的雷达，不要让自己和企业变成一个没有雷达的飞机。", "马上找到属于自己的目标，尽管你我现在的目标不是多么伟大，但是他是你实现伟大目标的必经之路。", "有了方向和目标以后，最重要的不是马上去找方法，而是先解决自己的意愿的问题，当然，作为一个管理者，你也需要解决好别人的意愿。", "意愿就是一个人为了实现目标而付出的行动力的决心。", "我们常说人要有压力，压力纯粹就是放屁和自欺欺人的，压力从来就没有和行动力以及目标和结果有过任何实际的联系，有压力而无所作为的人中国可以找出十多亿来，只有通过意愿变成超强的行动力，而产生出结果和实现目标的才是有价值的。如果有人天天喊我有压力，他99％的可能性就是喊喊而已，行动方面几乎什么也不会改变，因为他早就习惯这样了，他知道只要经常喊一喊有压力，别人就认为自己努力了，和到底去不去行动没有关系的。没有行动力，压力就是人最大的阻碍和自我欺骗的口头禅而已。", "压力喊的越多，行动力也就越差。是的，看到我这么说，很多人一定很不爽（我以后也会经常让你感觉不爽的，地球上可以爽的地方太多了，不过爽的同时，你其实还是什么都没改变），因为你自己就是这样的人，不过说实话，其实你早就看自己都感觉不爽了，只不过是你自己不敢面对而已。", "放弃压力，变成行动力，而行动力的根源来自于意愿，只有行动力才可以实现你的目标。", "一个人基本的做事方法取决于三个步骤：", "（1）意愿；（2）过程，包括方法、技能等等；（3）目标、结果。", "意愿决定了过程中的行动力，其实每个人都不缺少方法，太多的方法和机会都摆在你面前，你根本就看不到，因为你根本就没有意愿。没有意愿，再多的方法也没用，因为在你没有意愿的时候，给你方法你也不会去用，你甚至会觉得给你方法的人很烦。", "所以，意愿对于个人和管理而言，是非常重要的，意愿越大，成功的机会也就越大（前提是有方向和目标）。", "我又把人分成了四种，管理者和我们自己可以分别对号入座：1、高意愿、高技能；2、低意愿、高技能；3、高意愿、低技能；4、低意愿、低技能。", "第一种人（高意愿、高技能）属于可遇不可求的，你只需要给他不断的挑战和鼓励，就足够了。", "不过第一种人也有可能变成第二种人（低意愿、高技能），对于第二种人，经常会是一些老员工，做为当事人自己以及管理者，需要解决的主要是意愿的问题，让他们重新获得激情和行动力。", "第三种人（高意愿、低技能）多半是新人，尤其是大学毕业生，多用这样的人，他们会乐于接受和快速学习所有的方法和技能，很快成为高技能的人，只要他们的意愿足够的高。", "第四种人（低意愿、低技能），这种人对于一个企业而言，没有任何价值，直接开除掉就可以了。而如果你就是一个这样的人，要解决的根本不是技能问题，而是什么也别干，先解决好自己的意愿的问题，让自己变成第三种人。", "当一个人具备了很好的方向、目标和意愿以后，他就具备了创业以及走向工作岗位的基本条件了。", "很多人总认为我只要有了方法就一定能成功，这个是有前提条件的，所以我把方法放在了第四位。", "人最不缺的就是方法，最缺的也是方法。不缺的时候方法很多，就是用不上；缺的时候，方法也很多，就是没有最有效的那个。", "方法本身并不重要，为了实现目标而存在的方法是最重要的。", "这里从个人和管理双方面讲述方法，对于个人而言是如何获取正确的方法，对于管理者而言则是如何有效的传递方法。", "对于一般人而言，只有自己有强烈的意愿去实现目标的时候，就非常容易接受别人给予的方法，甚至自己去找寻方法，所以获取正确的方法的前提是目标和意愿的存在；对于不一般的人，他具备很好的学习和聆听的能力，把所有的方法变成自己的，在实现目标的那个环节中最恰当的方法来使用。", "对于管理者而言，管理的同时，方法会成为催化剂，这个催化剂可能是正面的，也可能是负面的。方法一定要在别人需要的时候再给予，也就是对方有意愿和需求去达成目标的时候。如果别人根本不需要方法，而你单方面的向对方灌输方法，那么这个效果则是负面的，对方不但不接受你的方法，反而会反感你，因为他当时根本就不需要方法。", "人最不缺的就是方法，最缺的也是方法。如何获取最需要的方法，如何把自己的方法有效的传递给别人，将是一项非常大的挑战。", "有了意愿和方法以及正确的方向，也不一定能够实现目标，因为太多的人是根本就没有毅力的。", "毅力＝坚持＋突破。", "举个会出现在大多数人身上的例子。我们给自己拟定了一个大目标，并为这个大目标制定了几个相应的小目标，不过在实现目标的过程中，小目标还没有完成，又出现了更多的目标。结果很多人就被目标把自己「搞死」了。", "不过，我们被目标搞死了，因为目标遇到一些难度或者阻碍的时候，我们就不去完成了，绕开它，然后寄希望于找到更多的新的目标去实现大目标。", "好了，你会发现，慢慢的，你已经失去了完成目标的能力了，当眼前的目标受阻，你就马上转移目标，就你那毅力，眼前的目标都完不成，你以为自己就能完成新的目标了？", "目标不能完成，而为之付出的过程无论多少都是白搭的，你的人生就在不断去做不能完成的目标，不断的去找新的不能完成的目标的过程中浪费掉了。", "所以，盯好眼前的目标就足够了，用你的毅力去战胜困难和阻碍，坚持和突破！慢慢的，你已经掌握了实现目标的能力了，而这完全归功于你的毅力。", "少找目标，多达成目标，你就不会被目标搞死了。", "困扰年轻的人无非两点，而且是两个极端：1、没有目标，没有意愿；2、目标太多，没有毅力。", "说了这么多辛苦的条件，我们总算可以见到成果了。", "成果就是目标的完成，该目标到此结束。", "最值得兴奋的就是成果，而不是过程。成果见证了你的5个必备条件的具备，标志着你已经具备了完成目标的能力，也意味着你可以去挑战更高的目标了。", "成果是验证点，成果是兴奋剂，只有成果真正体现出你的价值和能力的提升。", "那么，接下来你就可以进入更高的境界了：自我观察。", "我们太多的时候陷入过程而不能自拔，发现不了问题，如果没有高人指点，往往会陷入或者沉迷于过程而不能自拔。问题如果发现不了，就会迷失，肯定实现不了结果。", "既然不能总是依赖于高人的指点，我们只好进行自我观察，以另外一个站在事情外面的人来看观察自己。", "自我观察是我从2005年开始做的，我针对自我观察制定了一个简单的工具。", "任何事情的组成简化为：目标－过程－结果，而对于一个有目标的人，问题肯定会出现在过程中，所以一旦感觉不太对劲，马上用这个工具判断自己，我所进行的过程与我要实现的目标是否一致，问题出现在哪里？用目标来判断正在进行的过程是否相符，是否是最佳的过程，能否产生结果？", "这样，问题就会找出来，然后解决问题，目标就可以完成了。", "2005年的时候，我用这个简单的「目标－过程－结果」工具来帮助自己感觉不对劲的时候观察自己，2006年，这个工具已经变成了我的生理本能，任何时候我都可以站出来观察自己，只不过，看自己的高度的提升则是永无止境的。", "年轻人创业和发展七个要点：方向、目标、意愿、方法、毅力、成果、自我观察。是我这些创业的积累，希望对你有所帮助。"], "title": ["李想：关于创业和投资，我的六点思考"], "link": "http://www.jianshu.com/p/d3fa0faca9d9", "author": ["苑晶的简书大号"]},
{"article": ["消费互联网在现实生活中的无孔不入，其成功模式，被B2B产业从业者甚为推崇，认为互联网同样可以改变B2B产业生态。但是与消费互联网不同的是，B2B产业互联网面向的是制造业组织。而不同的行业，不同的企业，需匹配的解决方案也不尽相同。B2B行业中一两个企业不足以横扫整个市场，每一个垂直领域都有机会出现巨头，B2B行业仍是一片蓝海。", "为什么B2B电商会兴起？", "1互联网成为基础设施，交易平台减少中间环节", "互联网发展逐渐普及，通过互联网就是打掉一些不必要的中间层级，让整个社会的运转的效率更高。B2B的行业里面，这个效用更为突出。中国几乎所有的市场都是供过于求，这凸显了渠道的价值。比如传统医药行业价值链中，制药企业具有较高的定价权，药品批发企业集中度较低且多层代理 （全国级，省级，市级） 较为复杂。国家都出台两票制等政策来减少中间环节，B2B电商的本质即是缩减中间流通层级，让企业直接接触销售渠道。", "2产业信息化已经有深厚基础", "整个产业的信息化已经进行了多年，产业链上下游信息实现了及时和全面的聚合，这为B2B在线交易撮合、代卖和独立电商提供了扎实的基础。目前我国医院信息化发展迅速，医疗卫生信息化取得了令人瞩目的进展。", "3在线交易习惯的普及成熟", "B2C电子商务的发展培养了在线购物的习惯，为B2B电商兴起完成了在线交易的普及教育。另外从PC到手机，在线交易的硬件和支付等配套服务也非常成熟了。软件和硬件上充分的技术基础，这是B2B电商能够实现的基本前提。", "4移动互联网平台对小B的锁定在加强", "中国移动手机的普及，使得小企业小商家的日常运营，已经深度依赖移动互联网。无论在交易，采购，沟通，管理，还是支付环节，小B对移动互联网的依赖会越来越强。例如：", "（http://www.cnlist.org/）、", "（http://www.qth58.cn/）、", "（http://www.jinanfa.cn/）、", "（http://b2b.liebiao.com/）。这些站点提供了发布产品和服务的信息平台，使商家能够通过平台获得所需要的信息，在移动端获取的流量远超过PC端。", "5B2B标杆企业的龙头效应", "标杆企业，比如在线钢材交易平台“找钢网”。这公司的估值涨得很高，引来了很多人的效仿，各种找字辈的网站频出，也都具有良好的估值。这就是标杆的企业的龙头效应。一家标杆企业会繁衍出了一系列的小企业。", "62C创业遇到巨头流量瓶颈，2B创业打造独立生态系统闭环", "BAT已经基本控制了移动端的流量，流量越来越贵，网络C端流量的竞争很激烈，很多O2O和B2C电商都无法生存。对比之下，B2B的优势得到了凸显。因为不需要买流量，不需要大规模烧钱，大部分平台都活的很好，创业相对成功率高，这是一个很大的吸引力。"], "title": ["B2B电商兴起的原因"], "link": "http://www.jianshu.com/p/6d65956640fb", "author": ["吴雨桐儿"]},
{"article": ["先看数据：", "罗永浩《干货日记》预售3天破200万。", "马东《好好说话》上线第一天销售破500万。", "Kindle电子书年销售超50亿。", "Netflix数字电影租赁网站会员量破亿（会员平均年费超过100美元）。", "苹果App Store 2016年营收285亿美元。", "10几年前一个女生在淘宝买衣服都不被理解，如今别说是衣服这种实体商品，连数字化的虚拟商品都已经被卖出惊人的销售额。", "但是，即使是那些付了费的用户，也知道他花钱买下的虚拟产品，也许过不了几天就能在互联网上找到一模一样的免费资源，那为什么还要花钱？花钱买的是那些产品本身么？", "当一组数据进入互联网，就如同一篇文章被塞进了复印机，不管你写文章花了多少时间精力，", "内容，尤其是原创内容的命运面临着两极格局，一方面很多内容生产者收不到钱，鉴于电影、歌曲、文章、图片、程序都很容易被复制，尽管传统从业者挥着版权大旗，做出种种制度和技术上的抵抗，但事实上这些原创内容被复制或者说被盗版的速度越来越快了，", "在这场对抗复制品的战争中，进行的不是横向的较量，例如张三的歌和李四的歌做比较，也不是跨领域的较量，例如王五的文章和刘二麻子的摄影做比较，而是，", "从诞生之初就是红海的各大音乐平台，都是法院的常客，今天你告我，明天我告他，后天3家一起对簿公堂，无非是争版权。但对于吃瓜群众来说，如果铁了心不掏钱，有哪首歌是在互联网上不能免费找到的呢？", "那么，", "——", "法律和技术在对抗互联网的“复制”时从来都是显得力不从心的。", "这些附加价值包括：在购买产品之前的", "；产品使用过程中的", "；以及产品使用后的", "信任感当然是没有办法被大规模复制的。对你有信任，并不代表你可以把这部分信任复制给他，使得我对他也产生信任感。", "之所以我们，对那些被我们信任的事物给予特殊对待，是因为我们想要规避那些不被信任的事物有可能带来的风险。", "我们总是会下意识地放大风险可能带来的伤害，我们也会试图预先规避各种各样的风险，例如想获得一个软件，我们既可以从官方网站付费下载正版，也可以从某个不知名的论坛找到免费软件，但是，免费版本可能存在我们所无法掌控的风险，有可能被植入木马，有可能捆绑了恶意软件，这就使一些对于风险极度厌恶的人，会毫不犹豫的选择购买正版软件，例如当企业使用软件时，就会顾虑到到商业机密，和数据损失时带来的巨大成本。", "而建立起信任感，的好处也是显而易见的，比如罗永浩的创业课，预售三天，销量突破200万。很多人能够提前预付款，很大程度上是基于对罗永浩本人的信任。", "既然互联网里充斥着无穷无尽的信息，这些信息的质量和可信度也是参差不齐的，", "现在电子书已经极度泛滥，几乎所有知名的书籍，都可以在网上找到免费的资源。电子书本身的获得已经没有难度，这时难度就在于，如何从这些书中选择最值得读的那些书？所以好的书单可能不比书籍本身的价值低。", "同样的事情也发生在电影音乐等领域。什么电影值得看？哪些音乐值得听？李翔商业内参虽然提供的都是免费信息，但只要这些内容是为了某些特定的群体定向筛选过的，就含有信息筛选的附加价值。", "尽管网上能找到免费的电子书，但是每当你要读一本书都要进行一次搜寻工作，这时类似多看阅读的电子书app就显得很有吸引力了，它很方便，把所有的书都找好了，放在那里，你随时可以领取，只要付一点钱，而现在", "在十年前是很少有人会为了省时间付费的。我们总是不厌其烦地在互联网上搜索photoshop这类付费软件的破解版本。我们即使是想看电影，但是为了省钱，也愿意等待几周甚至几个月的时间，直到盗版电影出现。", "现在的用户不再愿意花一两个小时的时间，在十几个网站里尝试下载某个软件的破解版本，然后还要自己克服软件安装和打补丁的困难。尤其是时间成本较高的用户。", "现在的主流视频网站如何获取新的付费会员？他们通过更快地更新电影电视剧来吸引用户。", "甚至连免费电影前面播放广告的90秒，我们都不愿意等。", "即使某著名讲师的课，可以在互联网上找到免费版本。仍然有用户愿意为了实时和讲师互动，而购买付费版本。即使不能互动，能在专栏下面留言让讲师和其他用户看到也是有吸引力的。", "再比如知乎live的线上直播，稍后你可以从网上找到免费的盗版，但如果花钱参加，你就可以提问题，参与直播。", "即使你购买了某个视频网站的会员，可以在家观赏高清版本。但是有的电影你仍然愿意花更高的价格去电影院观看，例如我在看好莱坞动作大片时，就一定会去电影院，因为电影院的屏幕更大，音响更好。", "你买了王菲的唱片，但你仍然愿意花费十倍百倍于唱片的价格去演唱会听同样的歌；把本来完全免费的网络虚拟商品，做成实体的礼品卡就能完成某些线下场景的需求；把线上可以免费听的课，放到线下面对面重新讲一遍也是很不错的。", "你喜欢的歌手出的新专辑，也许可以在互联网上免费无限次的听，但如果让这位歌手为你的生日派对把歌词稍作修改，重新录制一版，那就耗费巨大了。", "持有这种价值观的人，接受了别人的馈赠之后，会想办法补偿回去。", "而通过打赏的方式，我们常常可以通过支付比通常购买相似产品低得多的价格，满足交易的价值观，如果在你的打赏通道中，选项只有一档，金额就必须足够低。", "人是社会关系的总和。你会买什么样的虚拟产品，就如同你会买什么牌子的衣服，什么牌子的手机，", "月薪5000的白领，花费5000元购买正版软件，这和从网上寻找盗版软件免费使用，在周围的人眼中形象是完全不同的。同样，你是学习了心理学的课还是java编程的课，听的是正版音乐还是盗版音乐，玩的是app store里的正版游戏，还是破解了内购的游戏，都是一次次的自我认同和形象确认。而为了展示这些，都有用户愿意为之付费。", "对于互联网上容易被复制的数字产品来说，这些他们愿意为之付费的价值必须是难以复制的。"], "title": ["变废为宝，把免费信息变成可交易的商品的9个方法！"], "link": "http://www.jianshu.com/p/4003b63a1f8f", "author": ["德荣笔记"]},
